//    ----------------------------------------------------------------------------------
//    Main Powerfull Point:
//    
//    تمامی رجکس ها مابین دو علامت اسلش می‌آیند
//    و
//    پس از آنها فلگ‌ها ظاهر می‌شوند که در ادامه فلگ‌ها را خواهیم گفت 
//    یعنی به شکل ===> /regex_pattern/flags
//    مثلاً فلگ حساس بودن به حروف کوچک و بزرگ
//    یا فلگ چندخطی و ...
//    ولی در حالت نرمال فلگ گلوبال با حرف جی استفاده می‌شود یعنی
//    //regex_pattern/g

//    ----------------------------------------------------------------------------------
//    Used Grammer:
//
//    \. (dot or point):    تمامی کاراکترهای (حرف، رقم، نشانه، فاصله و ...)

//    \w (small w):  تمامی کاراکترها (حرف، رقم و آندرلاین) به غیر از علامت‌ها و کاراکترهای خاص
//    \W (big w):    تمامی کاراکترها به غیر از حرف، رقم و آندرلاین - حالت برعکس قبل

//    \d (small d):   فقط کاراکترهای عددی
//    \D (big d):     هر چیزی به غیر از کاراکترهای عددی - حالت برعکس قبل

//    \s (small s):   فقط فاصله‌ها
//    \S (big s):     هر چیزی به غیر از فاصله - حالت برعکس قبل

//    ----------------------------------------------------------------------------------
//    Examples:
//
//    \lm:    ترکیب‌هایی که دقیقاً شامل یک اِل و به دنبال آن دقیقاً یک اِم باشد
//    \lm:     تمامی ترکیب‌های دقیقاً اِل-اِم
//    \lm+:   ترکیب‌هایی که شامل حتماً (یک اِل) و (حداقل یک اِم یا بیشتر) باشد
//    \lm*:   ترکیب‌هایی که شامل حتماً (یک اِل) و (صفر یا یک اِم یا بیشتر) باشد
//    \lm?:   ترکیب‌هایی که شامل (یک یا چند اِل) و به دنبال آن (هیچ یا یک اِم) باشد

//    \[RV]lm:  ترکیب‌هایی که حرف اول آنها آر یا وی باشد و به اِل-اِم ختم شوند
//    \[^RV]lm:  ترکیب‌هایی که حرف اول آنها آر یا وی نباشد و به اِل-اِم ختم شوند

//    \[a-zA-Z]lm: ترکیب‌هایی که حرف اول آنها یکی از حروف الفبا (بزرگ یا کوچک) باشد و به اِل-اِم ختم شوند
//    \[a-zA-Z2]lm: ترکیب‌هایی که حرف اول آنها یکی از حروف الفبا (بزرگ یا کوچک) باشد همچنین می‌تواند شامل رقم 2 هم باشد و به اِل-اِم ختم شوند
//    \[a-zA-Z0-9]lm: ترکیب‌هایی که حرف اول آنها یکی از حروف الفبا (بزرگ یا کوچک) باشد همچنین می‌تواند هر رقمی باشد و به اِل-اِم ختم شوند
//    \[a-zA-Z0-9@]lm: ترکیب‌هایی که حرف اول آنها یکی از حروف الفبا (بزرگ یا کوچک) باشد همچنین می‌تواند هر رقمی بوده
//                     و کاراکتر @ را هم درخودش داشته باشد و به اِل-اِم ختم شوند
//    \s\w{2}\s:   ترکیب‌هایی که فقط دو حرفی باشد و از کلمات قبل و بعد خود از هر طرف یک فاصله داشته باشد
//                 یعنی یک فاصله ، یک کلمه دو حرفی و مجدداً یک فاصله
//
//    \w{2,10}:   ترکیب‌هایی که از 2 حرف تا 10 حرف باشند را استخراج کند
//
//    ^:          اگر می‌خواهیم دقیقاً بگوییم که دقیقاً اول جمله باشد
//    $:          اگر می‌خواهیم دقیقاً بگوییم که دقیقاً آخر جمله باشد

//    ----------------------------------------------------------------------------------
//    Flags:
//    همانطور که در بالا نیز گفته شد پس از الگوی رجکس و بعد از اسلش انتهایی فلگ‌های کنترلی می‌آیند
//    که عبارتند از 
//    g:   گلوبال یعنی اگر در یک خط الگو چندبار هم تکرار شده بود آنها را استخراج کن
//         ولی اگر آن را برداریم فقط اولین مورد یافت شده را برمی‌گرداند و ادامه نمی‌دهد
//    i:   اگر ذکر شود رجکس به حروف بزرگ و کوچک حساس نیست ===>   insensitive
//         ولی اگر نیاید رجکس بزرگ و کوچک را متمایز می‌کند
//
//    m , s:   این دو فلگ یعنی فلگ‌ بررسی در چندخطی (مولتی‌لاین) و تک خطی (سینگل‌لاین) 
//             اگر شما به دنبال یک عبارت (آن هم به صورت گروهی) و فقط در ابتدای خطوط می‌گردید
//             اگر عبارت در ابتدای تمامی خطوط تکرار شده باشد
//             با سوئیچ تک‌خطی فقط اولین مورد یافت شده در اولین خط را به شما نشان می‌دهد 
//             ولی با سوئیچ چندخطی تمامی عبارات موجود در ابتدای خطوط را به شما برمی‌گرداند
//             و
//             اگر شما به دنبال یک عبارت (آن هم به صورت گروهی) و فقط در انتهای خطوط می‌گردید
//             اگر عبارت در انتهای تمامی خطوط تکرار شده باشد
//             با سوئیچ تک‌خطی فقط آخرین مورد یافت شده در آخرین خط را به شما نشان می‌دهد 
//             ولی با سوئیچ چندخطی تمامی عبارات موجود در انتهای تمامی خطوط را به شما برمی‌گرداند